; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v5 - type_1 ?v2 - type_2)
 	      (pred_4 ?v6 - object ?v2 - type_2)
	      (pred_2 ?v5 - type_1 ?v3 - type_3)
	      (pred_1 ?v5 - type_1 ?v6 - object ?v3 - type_3))

   (:action op_1
       :parameters  (?v5 - type_1 ?v4 ?v1 - type_2)
       :precondition (and  (pred_3 ?v5 ?v4))
       :effect (and  (pred_3 ?v5 ?v1)
		     (not (pred_3 ?v5 ?v4))))

   (:action op_2
       :parameters (?v5 - type_1 ?v7 - object ?v8 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_4 ?v7 ?v8) (pred_3 ?v5 ?v8) (pred_2 ?v5 ?v3))
       :effect (and (pred_1 ?v5 ?v7 ?v3)
		    (not (pred_4 ?v7 ?v8)) 
		    (not (pred_2 ?v5 ?v3))))

   (:action op_3
       :parameters (?v5 - type_1 ?v7 - object ?v8 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v7 ?v3) (pred_3 ?v5 ?v8))
       :effect (and (pred_4 ?v7 ?v8)
		    (pred_2 ?v5 ?v3)
		    (not (pred_1 ?v5 ?v7 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_10 - type_1
obj_01 obj_14 obj_13 obj_06 - type_3
obj_05 obj_09 obj_12 obj_02 - type_2
obj_03 obj_08 obj_04 obj_07 - object)
(:init
(pred_3 obj_11 obj_09)
(pred_2 obj_11 obj_01)
(pred_2 obj_11 obj_14)
(pred_3 obj_10 obj_02)
(pred_2 obj_10 obj_13)
(pred_2 obj_10 obj_06)
(pred_4 obj_03 obj_02)
(pred_4 obj_08 obj_02)
(pred_4 obj_04 obj_02)
(pred_4 obj_07 obj_12)
)
(:goal
(and
(pred_4 obj_03 obj_12)
(pred_4 obj_08 obj_12)
(pred_4 obj_04 obj_12)
(pred_4 obj_07 obj_12)
)
)

(:constraints
  (always (not (pred_3 obj_11 obj_12)))
)
)

; plan
1. (op_2 obj_10 obj_03 obj_02 obj_06)
   deleted: (pred_4 obj_03 obj_02) (pred_2 obj_10 obj_06)
   added: (pred_1 obj_10 obj_03 obj_06)
   goals met: 1 of 4
2. (op_1 obj_11 obj_09 obj_02)
   deleted: (pred_3 obj_11 obj_09)
   added: (pred_3 obj_11 obj_02)
   goals met: 1 of 4
3. (op_2 obj_10 obj_04 obj_02 obj_13)
   deleted: (pred_4 obj_04 obj_02) (pred_2 obj_10 obj_13)
   added: (pred_1 obj_10 obj_04 obj_13)
   goals met: 1 of 4
4. (op_1 obj_10 obj_02 obj_12)
   deleted: (pred_3 obj_10 obj_02)
   added: (pred_3 obj_10 obj_12)
   goals met: 1 of 4
5. (op_2 obj_11 obj_08 obj_02 obj_14)
   deleted: (pred_4 obj_08 obj_02) (pred_2 obj_11 obj_14)
   added: (pred_1 obj_11 obj_08 obj_14)
   goals met: 1 of 4
6. (op_3 obj_10 obj_04 obj_12 obj_13)
   deleted: (pred_1 obj_10 obj_04 obj_13)
   added: (pred_4 obj_04 obj_12) (pred_2 obj_10 obj_13)
   goals met: 2 of 4
7. (op_3 obj_10 obj_03 obj_12 obj_06)
   deleted: (pred_1 obj_10 obj_03 obj_06)
   added: (pred_4 obj_03 obj_12) (pred_2 obj_10 obj_06)
   goals met: 3 of 4
8. (op_3 obj_11 obj_08 obj_02 obj_14)
   deleted: (pred_1 obj_11 obj_08 obj_14)
   added: (pred_4 obj_08 obj_02) (pred_2 obj_11 obj_14)
   goals met: 3 of 4
9. (op_1 obj_10 obj_12 obj_02)
   deleted: (pred_3 obj_10 obj_12)
   added: (pred_3 obj_10 obj_02)
   goals met: 3 of 4
10. (op_2 obj_10 obj_08 obj_02 obj_06)
   deleted: (pred_4 obj_08 obj_02) (pred_2 obj_10 obj_06)
   added: (pred_1 obj_10 obj_08 obj_06)
   goals met: 3 of 4
11. (op_1 obj_10 obj_02 obj_12)
   deleted: (pred_3 obj_10 obj_02)
   added: (pred_3 obj_10 obj_12)
   goals met: 3 of 4
12. (op_3 obj_10 obj_08 obj_12 obj_06)
   deleted: (pred_1 obj_10 obj_08 obj_06)
   added: (pred_4 obj_08 obj_12) (pred_2 obj_10 obj_06)
   goals met: 4 of 4
